tube0013/esphome-components/components/efr32_flasher/efr32_flasher.cpp
// ====== EFR32 Flasher (external component) ======
#include "esphome/components/efr32_flasher/efr32_flasher.h"
#include "esphome/components/efr32_info/ash_util.h"
#include <vector>
#include <string>
#include <cstring>
#include <algorithm>
#include <strings.h>
#include <cctype>

#include "esphome/core/component.h"
#include "esphome/core/log.h"
#include "esphome/core/application.h"
#include "esphome/components/uart/uart.h"
#include "esphome/components/switch/switch.h"
#include "esphome/components/text_sensor/text_sensor.h"
#include "esphome/components/md5/md5.h"

#ifdef USE_ESP_IDF
#include "esphome/components/uart/uart_component_esp_idf.h"
#include "driver/uart.h"
#endif
#include <ArduinoJson.h>

#ifdef USE_ESP_IDF
  #include "esp_http_client.h"
  #include "esp_crt_bundle.h"
#else
  #error "EFR32 flasher requires ESP-IDF framework."
#endif

namespace esphome { namespace efr32_flasher {

static const char *const TAG = "efr32_flasher";

// Forward declarations for ASH helpers
void write_escaped_(esphome::uart::UARTComponent *uart, const uint8_t *data, size_t len);
bool recv_ash_frame_(esphome::uart::UARTComponent *uart, std::vector<uint8_t> &out, uint32_t timeout_ms);
// Minimal data/ack send helpers (file-static implementations below)
static void ash_send_data_(esphome::uart::UARTComponent *uart, const std::vector<uint8_t> &ezsp_payload, uint8_t frm_num, uint8_t ack_num, bool re_tx);
static void ash_send_ack_(esphome::uart::UARTComponent *uart, uint8_t ack_num, bool ncp_ready);
static void ash_randomize_(uint8_t *data, size_t len);
std::vector<uint8_t> build_ezsp_get_version_();

// XMODEM constants
static constexpr uint8_t SOH = 0x01; // 128B
static constexpr uint8_t STX = 0x02; // 1024B (not used initially)
static constexpr uint8_t EOT = 0x04;
static constexpr uint8_t ACK = 0x06;
static constexpr uint8_t NAK = 0x15;
static constexpr uint8_t CAN = 0x18;
static constexpr uint8_t CCHR = 'C';

// HTTP event handler to accumulate body during esp_http_client_perform()
static esp_err_t http_event_handler(esp_http_client_event_t *evt){
  if (evt->event_id == HTTP_EVENT_ON_DATA && evt->user_data && evt->data && evt->data_len > 0){
    auto *body = reinterpret_cast<std::string*>(evt->user_data);
    body->append(reinterpret_cast<const char*>(evt->data), evt->data_len);
  }
  return ESP_OK;
}

EFR32Flasher::~EFR32Flasher() {}

void EFR32Flasher::setup(){
  // Avoid any UART activity at boot to prevent consuming ASH startup frames.
  // If needed, a manual probe action can be invoked later.
  this->apply_runtime_baud_();
}

void EFR32Flasher::set_uart_baud_(uint32_t baud) {
  if (this->uart_ == nullptr)
    return;
  if (baud == 0)
    return;
  if (this->uart_->get_baud_rate() == baud) {
    ESP_LOGV(TAG, "UART baud rate already %u", static_cast<unsigned>(baud));
    return;
  }

  // Ensure any outstanding TX completes before retuning the peripheral.
  this->uart_->flush();

  this->uart_->set_baud_rate(baud);
#if defined(USE_ESP8266) || defined(USE_ESP32)
  this->uart_->load_settings(false);
#endif
#ifdef USE_ESP_IDF
  if (this->uart_ != nullptr) {
    auto *idf_uart = static_cast<esphome::uart::IDFUARTComponent *>(this->uart_);
    uart_port_t port = static_cast<uart_port_t>(idf_uart->get_hw_serial_number());
    uart_set_pin(port, 4, 36, 2, 13);
    uart_set_hw_flow_ctrl(port, UART_HW_FLOWCTRL_CTS_RTS, 122);
  }
#endif
  // Give the hardware a moment to settle at the new rate.
  delay_(100);
  uint32_t reported = this->uart_->get_baud_rate();
  ESP_LOGD(TAG, "UART baud rate set to %u (reported=%u)", static_cast<unsigned>(baud),
           static_cast<unsigned>(reported));
}

void EFR32Flasher::apply_runtime_baud_() {
  uint32_t baud = runtime_baud_rate_;
  if (baud == 0 && this->uart_ != nullptr) {
    baud = this->uart_->get_baud_rate();
    runtime_baud_rate_ = baud;
  }
  set_uart_baud_(baud);
}

void EFR32Flasher::apply_bootloader_baud_() {
  set_uart_baud_(bootloader_baud_rate_);
}

void EFR32Flasher::delay_(uint32_t ms){
  uint32_t start = millis();
  while (millis() - start < ms) { App.feed_wdt(); esphome::delay(1); }
}

bool EFR32Flasher::read_byte_(uint8_t &b, uint32_t timeout_ms){
  uint32_t start = millis();
  while (millis() - start < timeout_ms){
    if (uart_ && uart_->available()){
      if (uart_->read_byte(&b)) return true;
    }
    delay_(1);
  }
  return false;
}

bool EFR32Flasher::await_char_(uint8_t expect, uint32_t timeout_ms){
  uint8_t b=0;
  if(!read_byte_(b, timeout_ms)) return false;
  if (b == expect) return true;
  uint32_t end = millis() + timeout_ms;
  while (millis() < end){ if (uart_ && uart_->available() && uart_->read_byte(&b)) { if (b==expect) return true; } delay_(1); }
  return false;
}

void EFR32Flasher::flush_uart_(){
  uint8_t b;
  for(int i=0;i<64;i++){
    bool any=false;
    while(uart_ && uart_->available()){ uart_->read_byte(&b); any=true; App.feed_wdt(); }
    if(!any) break; delay_(2);
  }
}

bool EFR32Flasher::http_open_(const std::string &url, esp_http_client_handle_t &client, int timeout_ms){
  std::string cur = url;
  for (int redirects = 0; redirects < 5; redirects++){
    esp_http_client_config_t cfg = {};
    cfg.url = cur.c_str();
    cfg.timeout_ms = timeout_ms;
    cfg.crt_bundle_attach = esp_crt_bundle_attach;
    cfg.disable_auto_redirect = true; // handle redirects manually for reliability
    client = esp_http_client_init(&cfg);
    if(!client) return false;
    if(esp_http_client_open(client, 0) != ESP_OK){ esp_http_client_cleanup(client); return false; }

    (void)esp_http_client_fetch_headers(client);
    int status = esp_http_client_get_status_code(client);
    if(status == 200){
      return true;
    }
    if (status == 301 || status == 302 || status == 303 || status == 307 || status == 308){
      // Try to follow Location header
      char *loc = nullptr;
      esp_http_client_get_header(client, "Location", &loc);
      ESP_LOGW(TAG, "HTTP redirect %d to: %s", status, (loc && *loc) ? loc : "<none>");
      esp_http_client_close(client); esp_http_client_cleanup(client);
      if (loc && *loc){ cur = loc; continue; }
      return false;
    }
    char first[256]; int n = esp_http_client_read(client, first, sizeof(first));
    ESP_LOGE(TAG,"HTTP status %d, first bytes: %.*s", status, n>0?n:0, first);
    esp_http_client_close(client); esp_http_client_cleanup(client);
    return false;
  }
  ESP_LOGE(TAG, "Too many HTTP redirects while fetching: %s", cur.c_str());
  return false;
}

