tube0013/esphome-components/components/efr32_flasher/efr32_flasher.cpp
bool EFR32Flasher::fetch_manifest_(const std::string &url, std::string &fw_url_out){
  ESP_LOGI(TAG, "fetch_manifest: url=%s", url.c_str());
  // Use perform API to follow redirects automatically and accumulate full body
  std::string body; body.reserve(1024);
  esp_http_client_config_t cfg = {};
  cfg.url = url.c_str();
  cfg.timeout_ms = 15000;
  cfg.crt_bundle_attach = esp_crt_bundle_attach;
  cfg.disable_auto_redirect = false; // allow IDF to follow redirects
  cfg.event_handler = http_event_handler;
  cfg.user_data = &body;

  esp_http_client_handle_t client = esp_http_client_init(&cfg);
  if (!client) return false;
  esp_err_t perr = esp_http_client_perform(client);
  int status = esp_http_client_get_status_code(client);
  if (perr != ESP_OK || status != 200){
    ESP_LOGE(TAG, "Manifest HTTP perform failed: %s status=%d", esp_err_to_name(perr), status);
    esp_http_client_cleanup(client);
    return false;
  }
  esp_http_client_cleanup(client);

  JsonDocument doc;
  auto err = deserializeJson(doc, body);
  if(err){ ESP_LOGE(TAG,"JSON parse error: %s", err.c_str()); return false; }

  fw_url_out.clear(); expected_md5_.clear(); expected_size_=0; manifest_version_.clear();

  // Try variants object: choose based on forced variant or autodetected key
  if (doc["variants"].is<JsonObjectConst>()){
    auto obj = doc["variants"].as<JsonObjectConst>();
    std::string key;
    if (!variant_key_override_.empty()) key = variant_key_override_;
    else if (variant_force_ == 1) key = "MGM24";
    else if (variant_force_ == 2) key = "BM24";

    if (!key.empty()){
      auto v = obj[key.c_str()];
      if (!v.isNull()){
        if (v["fw_url"].is<const char*>()) fw_url_out = v["fw_url"].as<const char*>();
        if (v["md5"].is<const char*>()) expected_md5_ = v["md5"].as<const char*>();
        if (v["size"].is<uint32_t>()) expected_size_ = v["size"].as<uint32_t>();
        ESP_LOGI(TAG, "Manifest variant '%s' selected", key.c_str());
      } else {
        ESP_LOGW(TAG, "Manifest does not provide variant '%s'", key.c_str());
      }
    }

    if (fw_url_out.empty() && !obj.isNull() && obj.size() > 0){
      ESP_LOGW(TAG, "Manifest has %u variants but none matched autodetect/override; defaulting to first entry",
               (unsigned) obj.size());
      for (auto kv : obj) {
        auto v = kv.value();
        if (v["fw_url"].is<const char*>()) fw_url_out = v["fw_url"].as<const char*>();
        if (v["md5"].is<const char*>()) expected_md5_ = v["md5"].as<const char*>();
        if (v["size"].is<uint32_t>()) expected_size_ = v["size"].as<uint32_t>();
        ESP_LOGI(TAG, "Using manifest variant '%s' as fallback", kv.key().c_str());
        break;
      }
    }
  }
  if (fw_url_out.empty()){
    if (doc["fw_url"].is<const char*>()) fw_url_out = doc["fw_url"].as<const char*>();
    else if (doc["firmware_url"].is<const char*>()) fw_url_out = doc["firmware_url"].as<const char*>();
    else if (doc["url"].is<const char*>()) fw_url_out = doc["url"].as<const char*>();
  }
  // Optional metadata
  if (expected_md5_.empty() && doc["md5"].is<const char*>()) expected_md5_ = doc["md5"].as<const char*>();
  if (!expected_size_ && doc["size"].is<uint32_t>()) expected_size_ = doc["size"].as<uint32_t>();
  if (doc["version"].is<const char*>()) manifest_version_ = doc["version"].as<const char*>();

  if (fw_url_out.empty()) { ESP_LOGE(TAG, "Manifest missing firmware URL."); return false; }
  if (!expected_md5_.empty()) ESP_LOGI(TAG, "Manifest MD5=%s", expected_md5_.c_str());
  if (expected_size_) ESP_LOGI(TAG, "Manifest size=%u", (unsigned)expected_size_);
  if (!manifest_version_.empty()) ESP_LOGI(TAG, "Manifest version=%s", manifest_version_.c_str());
  return true;
}

void EFR32Flasher::enter_bootloader_(){
  if (!bl_sw_ || !rst_sw_) return;
  ESP_LOGI(TAG, "Entering Gecko bootloader (BL+RST)…");
  // Mirror the proven sequence used in your YAML script:
  // 1) Assert boot pin
  // 2) Hold ~1s, then assert reset for ~1s
  // 3) Release reset, keep boot asserted for ~5s
  // 4) Release boot
  bl_sw_->turn_on();           // inverted: drives boot pin active
  delay_(1000);
  rst_sw_->turn_on();          // inverted: drives reset active (low)
  delay_(1000);
  rst_sw_->turn_off();         // release reset
  delay_(5000);
  bl_sw_->turn_off();          // release boot pin
  delay_(200);
  // Clear any spuriously buffered bytes before menu selection
  flush_uart_();
}

void EFR32Flasher::leave_bootloader_(){
  if (!rst_sw_) return;
  ESP_LOGD(TAG, "Exiting bootloader via reset…");
  rst_sw_->turn_on(); delay_(15); rst_sw_->turn_off();
}

bool EFR32Flasher::xmodem_send_(esp_http_client_handle_t client, uint32_t content_len){
  // XMODEM-CRC 128-byte blocks
  std::vector<uint8_t> net_buf(1024);
  std::vector<uint8_t> block(128, 0x1A);
  uint32_t sent = 0; uint8_t seq = 1; uint32_t last_pc=0;
  esphome::md5::MD5Digest md5; md5.init();

  ESP_LOGD(TAG, "Waiting for receiver 'C'…");
  uint32_t tstart = millis();
  bool got_c = false;
  uint32_t last_cr = 0;
  bool resent_menu_6s = false;
  bool resent_menu_12s = false;
  uint8_t sample_buf[32];
  size_t sample_len = 0;
  uint32_t last_report = 0;
  while (millis() - tstart < 15000){
    uint8_t b;
    if (read_byte_(b, 250)) {
      if (b == CCHR) {
        got_c = true;
        break;
      }
      if (sample_len < sizeof(sample_buf)) {
        sample_buf[sample_len++] = b;
      }
      uint32_t now = millis();
      if (now - last_report > 1000) {
        ESP_LOGD(TAG, "Bootloader RX byte 0x%02X while waiting for 'C'", static_cast<unsigned>(b));
        last_report = now;
      }
    }
    uint32_t elapsed = millis() - tstart;
    if (elapsed >= 3000 && (elapsed - last_cr) >= 2000) {
      ESP_LOGD(TAG, "No 'C' yet (~%us), sending CR to prompt bootloader", (unsigned)(elapsed/1000));
      uart_->write_byte('\r');
      last_cr = elapsed;
    }
    if (!resent_menu_6s && elapsed >= 6000) {
      ESP_LOGD(TAG, "No 'C' yet (~6s), re-sending '1'+CR to select upload");
      uart_->write_byte('1');
      uart_->write_byte('\r');
      resent_menu_6s = true;
    }
    if (!resent_menu_12s && elapsed >= 12000) {
      ESP_LOGD(TAG, "No 'C' yet (~12s), re-sending '1'+CR to select upload");
      uart_->write_byte('1');
      uart_->write_byte('\r');
      resent_menu_12s = true;
    }
  }
  if (!got_c){
    if (sample_len > 0) {
      char buf[3 * sizeof(sample_buf) + 1];
      size_t pos = 0;
      for (size_t i = 0; i < sample_len && pos + 3 < sizeof(buf); i++) {
        pos += std::snprintf(buf + pos, sizeof(buf) - pos, "%02X", static_cast<unsigned>(sample_buf[i]));
      }
      buf[pos] = '\0';
      ESP_LOGW(TAG, "Bootloader received unexpected bytes while waiting for 'C': %s", buf);
    }
    ESP_LOGE(TAG, "Receiver did not send 'C' to start XMODEM");
    return false;
  }

  while (sent < content_len){
    // Fill a 128-byte payload from network
    size_t need = 128; size_t off=0;
    while (off < need){
      int r = esp_http_client_read(client, (char*)net_buf.data(), std::min((size_t)net_buf.size(), need-off));
      if (r < 0) return false;
      if (r == 0) break; // EOF
    std::memcpy(block.data()+off, net_buf.data(), r);
      off += r; sent += r; App.feed_wdt();
    }
    if (off == 0) break; // no more data
    if (off < 128){ std::fill(block.begin()+off, block.end(), 0x1A); }

