tube0013/esphome-components/components/efr32_flasher/efr32_flasher.cpp
    // Build and send XMODEM frame
    uint8_t hdr[3] = { SOH, seq, (uint8_t)(0xFF - seq) };
    uint16_t crc = crc16_ccitt_(block.data(), 128);

    uart_->write_array(hdr, 3);
    uart_->write_array(block.data(), 128);
    uint8_t crc_be[2] = { (uint8_t)(crc>>8), (uint8_t)(crc & 0xFF) };
    uart_->write_array(crc_be, 2);

    // Await ACK/NAK
    uint8_t resp=0; uint32_t wait_ms=3000; uint32_t start=millis(); bool ok=false;
    while (millis() - start < wait_ms){ if (read_byte_(resp, 250)) { if(resp==ACK){ ok=true; break; } if(resp==NAK){ ok=false; break; } if(resp==CAN){ ESP_LOGE(TAG, "Receiver cancelled (CAN)"); return false; } } }
    if(!ok){ ESP_LOGW(TAG, "NAK or timeout on block %u, retrying…", (unsigned)seq); continue; }
    // Update MD5 only for the actual payload size read from network (exclude padding)
    if (off > 0) md5.add(block.data(), off);
    seq++;
    update_progress_(sent, content_len, last_pc);
  }

  // Send EOT
  uart_->write_byte(EOT);
  uint8_t resp=0; if(!read_byte_(resp, 2000) || resp!=ACK){ ESP_LOGE(TAG, "No ACK after EOT"); return false; }
  md5.calculate(); char md5hex[33]; md5.get_hex(md5hex); md5hex[32]=0;
  if (!expected_md5_.empty() && expected_md5_.size()==32 && strcasecmp(expected_md5_.c_str(), md5hex)!=0){
    ESP_LOGE(TAG, "MD5 mismatch: expected %s, got %s", expected_md5_.c_str(), md5hex);
    return false;
  }
  ESP_LOGI(TAG, "XMODEM transfer complete. bytes=%u md5=%s", (unsigned)sent, md5hex);
  return true;
}

void EFR32Flasher::update_progress_(uint32_t total, uint32_t expected, uint32_t &last_pc){
  if(!show_progress_) return;
  if(expected>0){ uint32_t pc=(uint64_t)total*100/expected; if(pc>=last_pc+progress_step_){ last_pc=pc-(pc%progress_step_); ESP_LOGI(TAG,"Progress: %u%% (%u/%u)",(unsigned)pc,(unsigned)total,(unsigned)expected);} }
  else { if(total/65536>last_pc){ last_pc=total/65536; ESP_LOGI(TAG,"Progress: %u bytes",(unsigned)total);} }
}

void EFR32Flasher::run_update_(){
  apply_runtime_baud_();
  ESP_LOGI(TAG, "run_update start variant_force=%u override='%s'", static_cast<unsigned>(variant_force_),
           variant_key_override_.c_str());
  if(!uart_ || !bl_sw_ || !rst_sw_){ ESP_LOGE(TAG, "Not configured (uart/switches)"); return; }
  variant_key_override_.clear();
  if (variant_force_ == 0){
    variant_key_override_ = detect_variant_key_();
    if (variant_key_override_.empty()){
      ESP_LOGW(TAG, "Auto variant detection did not yield a match; using manifest fallback");
    }
  }
  ESP_LOGD(TAG, "Detected override='%s'", variant_key_override_.c_str());
  set_busy_(true);
  std::string fw_url;
  if (!fetch_manifest_(manifest_url_, fw_url)) { ESP_LOGE(TAG, "Manifest fetch/parse failed"); set_busy_(false); return; }
  ESP_LOGI(TAG, "Firmware: %s", fw_url.c_str());

  esp_http_client_handle_t client;
  if(!http_open_(fw_url, client)) { ESP_LOGE(TAG, "Firmware HTTP open failed"); set_busy_(false); return; }
  int64_t len64 = esp_http_client_get_content_length(client);
  uint32_t content_len = len64 > 0 ? (uint32_t)len64 : 0;

  apply_bootloader_baud_();
  enter_bootloader_();
  ESP_LOGD(TAG, "Bootloader entered, starting upload");
  // Allow BL banner/prompt to appear, then select '1' (upload gbl)
  delay_(1000);
  // Nudge BL prompt
  uart_->write_byte('\r');
  delay_(200);
  flush_uart_();
  ESP_LOGD(TAG, "Selecting 'upload gbl' (sending '1' + CR)");
  uart_->write_byte('1');
  uart_->write_byte('\r');
  delay_(200);

  bool ok = xmodem_send_(client, content_len);

  esp_http_client_close(client); esp_http_client_cleanup(client);

  leave_bootloader_();
  apply_runtime_baud_();
  ESP_LOGI(TAG, "run_update finished ok=%d", ok ? 1 : 0);
  if (ok) {
    ESP_LOGI(TAG, "EFR32 update finished OK. Waiting for NCP start marker…");
    if (wait_for_ncp_start_(1500)) {
      ESP_LOGI(TAG, "NCP start marker {~ detected.");
    } else {
      ESP_LOGW(TAG, "No NCP start marker seen in 1.5s (firmware may still boot later).");
    }
  } else {
    ESP_LOGE(TAG, "EFR32 update failed");
  }
  set_busy_(false);
}

void EFR32Flasher::run_check_update_(){
  apply_runtime_baud_();
  ESP_LOGI(TAG, "Checking EFR32 firmware manifest…");
  if (variant_force_ == 0 && variant_key_override_.empty()){
    variant_key_override_ = detect_variant_key_();
    if (variant_key_override_.empty()){
      ESP_LOGW(TAG, "Auto variant detection did not yield a match; using manifest fallback");
    }
  }
  ESP_LOGD(TAG, "run_check_update variant override='%s' force=%u", variant_key_override_.c_str(),
           static_cast<unsigned>(variant_force_));
  std::string fw_url;
  if (!fetch_manifest_(manifest_url_, fw_url)) { ESP_LOGE(TAG, "Manifest fetch/parse failed"); return; }
  if (!manifest_version_.empty() && latest_text_) latest_text_->publish_state(manifest_version_.c_str());
}

#if 0  // legacy probing removed; handled by efr32_tools

// Legacy probe_info removed

// Non-blocking probe-lite: send ASH RST and try to capture a single RSTACK frame.
/* void EFR32Flasher::step_probe_lite_(){ // removed
  switch (pl_state_) {
    case PL_IDLE:
      if (!want_probe_lite_) return;
      want_probe_lite_ = false;
      ESP_LOGI(TAG, "probe_lite: begin (RST -> RSTACK, non-blocking)");
      set_busy_(true);
      pl_settle_until_ = millis() + 500;  // slightly longer settle for pause switch
      pl_state_ = PL_SETTLE;
      break;

    case PL_PAUSE_SS:
      // Unused (kept for possible future refinement)
      pl_state_ = PL_SETTLE;
      break;

    case PL_SETTLE:
      if (millis() < pl_settle_until_) break;
      // minimal UART cleanup; keep quick
      flush_uart_();
      pl_state_ = PL_SEND_RST;
      break;

    case PL_SEND_RST: {
      if (!uart_) { pl_state_ = PL_RESUME_SS; break; }
      const uint8_t rst_frame[] = { 0x1A, 0xC0, 0x38, 0xBC, 0x7E };
      uart_->write_array(rst_frame, sizeof(rst_frame));
      // Start capturing immediately; some RSTACKs may already have emitted the start flag.
      pl_in_frame_ = true; pl_esc_ = false; pl_buf_.clear();
      pl_deadline_ = millis() + 1500; // extend capture window; still in small loop slices
      pl_state_ = PL_WAIT_RSTACK;
      break;
    }

    case PL_WAIT_RSTACK: {
      if (!uart_) { pl_state_ = PL_RESUME_SS; break; }
      // Consume only what is available now; stop at FLAG-terminated frame
      for (int i = 0; i < 48; i++) {  // small chunk each loop
        uint8_t b;
        if (!(uart_->available() && uart_->read_byte(&b))) break;
        if (b == 0x7E) { // FLAG
          if (pl_in_frame_) {
            // End of frame; drop trailing FCS (2B) if present
            if (pl_buf_.size() >= 2) pl_buf_.resize(pl_buf_.size() - 2);
            // Try to extract version: search for 0xC1 <ver>
            if (ezsp_protocol_text_) {
              uint8_t verb = 0;
              bool found = false;
              for (size_t j = 0; j + 1 < pl_buf_.size(); j++) {
                if (pl_buf_[j] == 0xC1) { verb = pl_buf_[j+1]; found = true; break; }
              }
              if (found) {
                char ver[16]; snprintf(ver, sizeof(ver), "ASHv%u", (unsigned) verb);
                ezsp_protocol_text_->publish_state(ver);
                ESP_LOGI(TAG, "probe_lite: captured RSTACK, version=%u", (unsigned) verb);
              } else {
                ESP_LOGD(TAG, "probe_lite: ASH frame captured (len=%u), version tag not found", (unsigned) pl_buf_.size());
              }
            }
            pl_state_ = PL_RESUME_SS;
            break;
          } else {
            pl_in_frame_ = true; pl_esc_ = false; pl_buf_.clear();
          }
          continue;
        }
        if (!pl_in_frame_) continue;
        if (pl_esc_) { pl_buf_.push_back(b ^ 0x20); pl_esc_ = false; }
        else if (b == 0x7D) { pl_esc_ = true; }
        else { pl_buf_.push_back(b); }
      }
      if (millis() >= pl_deadline_) {
        ESP_LOGW(TAG, "probe_lite: no ASH frame within window");
        pl_state_ = PL_RESUME_SS;
      }
      break;
    }

