tube0013/esphome-components/components/efr32_flasher/efr32_flasher.cpp
    case PL_RESUME_SS:
      pl_state_ = PL_DONE;
      break;

    case PL_DONE:
      // one-shot; return to idle and release busy flag
      set_busy_(false);
      pl_state_ = PL_IDLE;
      break;
  }
} */

// Probe EZSP version: minimal ASH exchange to request EZSP version, publish response.
/* void EFR32Flasher::step_probe_ezsp_version_(){ // removed
  switch (pv_state_) {
    case PV_IDLE:
      if (!want_probe_ezsp_ver_) return;
      want_probe_ezsp_ver_ = false;
      ESP_LOGI(TAG, "probe_ezsp_version: begin (non-blocking)");
      set_busy_(true);
      // Give YAML on_press automation time to pause stream_server
      pv_deadline_ = millis() + 500; // base settle window
      pv_quiet_start_ = millis();
      pv_cap_until_ = millis() + 1200; // absolute cap
      pv_state_ = PV_BUSY_ON;
      break;
    case PV_BUSY_ON:
      // Track quiet time on UART; reset quiet start if bytes are flowing
      if (uart_ && uart_->available()) pv_quiet_start_ = millis();
      if (millis() < pv_deadline_) break; // initial settle not elapsed yet
      // Require ~250ms of quiet UART or hit the cap before proceeding
      if ((millis() - pv_quiet_start_) < 250 && millis() < pv_cap_until_) break;
      pv_state_ = PV_FLUSH;
      break;
    case PV_FLUSH:
      flush_uart_();
      { const uint8_t rst[] = {0x1A,0xC0,0x38,0xBC,0x7E}; uart_->write_array(rst, sizeof(rst)); }
      pv_deadline_ = millis() + 800;
      pv_state_ = PV_WAIT_RSTACK;
      break;
    case PV_WAIT_RSTACK: {
      std::vector<uint8_t> fr;
      if (recv_ash_frame_(uart_, fr, 80)) {
        // Extract ASH version and publish
        if (!fr.empty() && ezsp_protocol_text_) {
          uint8_t verb = 0; bool found=false;
          for (size_t j=0;j+1<fr.size();j++){ if (fr[j]==0xC1){ verb=fr[j+1]; found=true; break; } }
          if (found){ char ver[16]; snprintf(ver,sizeof(ver),"ASHv%u",(unsigned)verb); ezsp_protocol_text_->publish_state(ver); }
        }
        // Send a minimal Supervisory ACK control to complete link after RSTACK.
        { ash_send_ack_(uart_, /*ack_num=*/0, /*ncp_ready=*/false); delay_(20); }

        // Move on to sending EZSP getVersion (v7 first, then v8 fallback)
        pv_state_ = PV_SEND_GETVER;
      } else if (millis() >= pv_deadline_) {
        pv_state_ = PV_SEND_GETVER;
      }
      break; }
    case PV_SEND_GETVER: {
      // Send EZSP v8-style getValue(VERSION_INFO)
      {
        std::vector<uint8_t> ez = build_ezsp_get_version_();
        ash_send_data_(uart_, ez, /*frm_num=*/0, /*ack_num=*/0, /*re_tx=*/false);
      }
      pv_deadline_ = millis() + 800;
      pv_state_ = PV_WAIT_REPLY;
      break; }
    case PV_WAIT_REPLY: {
      // Try to read one DATA frame; skip ACK/CTRL-only frames (e.g., 0xA0)
      std::vector<uint8_t> fr;
      uint32_t until = millis() + 800;
      bool got_data = false;
      while (millis() < until){
        if (!recv_ash_frame_(uart_, fr, 60)) { delay_(10); continue; }
        if (fr.empty()) { continue; }
        // DATA frames have first byte <= 0x1F; control/ACK frames have >= 0x80
        if (fr[0] > 0x1F) { continue; }
        got_data = true;
        break;
      }
      if (got_data){
        // De-randomize EZSP payload before sampling (skip ASH control byte)
        std::vector<uint8_t> ez(fr.begin() + 1, fr.end());
        if (!ez.empty()) ash_randomize_(ez.data(), ez.size());
        if (xncp_version_text_ || installed_stack_text_) {
          char sample[64]; size_t dlen = ez.size() > 12 ? 12 : ez.size(); size_t pos=0;
          for (size_t i=0;i<dlen && pos+3<sizeof(sample);i++) pos += snprintf(sample+pos, sizeof(sample)-pos, "%02X", ez[i]);
          sample[(pos < sizeof(sample)) ? pos : (sizeof(sample)-1)]='\0';
          char buf[96]; snprintf(buf, sizeof(buf), "EZSPv7 ezlen=%u hex=%s%s", (unsigned) ez.size(), sample, ez.size()>dlen?"…":"");
          if (xncp_version_text_) xncp_version_text_->publish_state(buf);
          if (installed_stack_text_) installed_stack_text_->publish_state(buf);
        }
        pv_state_ = PV_DONE; break;
      }
      if (millis() >= pv_deadline_) {
        // Retry once: send again
        {
          std::vector<uint8_t> ez = build_ezsp_get_version_();
          ash_send_data_(uart_, ez, /*frm_num=*/0, /*ack_num=*/0, /*re_tx=*/true);
        }
        // wait briefly for any DATA reply
        uint32_t until2 = millis() + 700;
        while (millis() < until2){
          if (!recv_ash_frame_(uart_, fr, 60)) { delay_(10); continue; }
          if (fr.empty() || fr[0] > 0x1F) { continue; }
          if (xncp_version_text_ || installed_stack_text_) {
            std::vector<uint8_t> ez(fr.begin() + 1, fr.end());
            if (!ez.empty()) ash_randomize_(ez.data(), ez.size());
            char sample[64]; size_t dlen = ez.size() > 12 ? 12 : ez.size(); size_t pos=0;
            for (size_t i=0;i<dlen && pos+3<sizeof(sample);i++) pos += snprintf(sample+pos, sizeof(sample)-pos, "%02X", ez[i]);
            sample[(pos < sizeof(sample)) ? pos : (sizeof(sample)-1)]='\0';
            char buf[96]; snprintf(buf, sizeof(buf), "EZSPv8 ezlen=%u hex=%s%s", (unsigned) ez.size(), sample, ez.size()>dlen?"…":"");
            if (xncp_version_text_) xncp_version_text_->publish_state(buf);
            if (installed_stack_text_) installed_stack_text_->publish_state(buf);
          }
          break;
        }
        pv_state_ = PV_DONE;
      }
      break; }
    case PV_DONE:
      ESP_LOGD(TAG, "probe_ezsp_version: done");
      set_busy_(false);
      pv_state_ = PV_IDLE;
      break;
  }
} */
#endif  // legacy probing

void EFR32Flasher::loop(){
  if (want_check_){ want_check_ = false; run_check_update_(); return; }
  if (!want_update_) return; want_update_ = false; run_update_();
}

std::string EFR32Flasher::detect_variant_key_(){
  auto normalize = [](const std::string &input) {
    std::string norm;
    norm.reserve(input.size());
    for (char ch : input) {
      if (ch == ' ' || ch == '-' || ch == '_' || ch == '/' || ch == '\\' || ch == '.')
        continue;
      norm.push_back(static_cast<char>(std::toupper(static_cast<unsigned char>(ch))));
    }
    return norm;
  };

  auto match_from_source = [&](const char *label, esphome::text_sensor::TextSensor *sensor) -> std::string {
    if (sensor == nullptr)
      return {};
    std::string value = sensor->get_state();
    if (value.empty())
      return {};
    std::string norm = normalize(value);
    if (norm.empty())
      return {};

    ESP_LOGD(TAG, "Variant probe %s='%s' (norm='%s')", label, value.c_str(), norm.c_str());

