tube0013/esphome-components/components/efr32_flasher/efr32_flasher.cpp
    if (norm.find("BMMG24") != std::string::npos || norm.find("BM24") != std::string::npos) {
      ESP_LOGI(TAG, "Variant detected as BM24 via %s='%s'", label, value.c_str());
      return "BM24";
    }
    if (norm.find("MGM24") != std::string::npos || norm.find("MG24") != std::string::npos) {
      ESP_LOGI(TAG, "Variant detected as MGM24 via %s='%s'", label, value.c_str());
      return "MGM24";
    }
    return {};
  };

  if (auto key = match_from_source("board_name", board_name_text_); !key.empty())
    return key;
  if (auto key = match_from_source("mfg_string", mfg_string_text_); !key.empty())
    return key;
  if (auto key = match_from_source("manufacturer", manuf_id_text_); !key.empty())
    return key;
  if (auto key = match_from_source("chip", chip_text_); !key.empty())
    return key;

  ESP_LOGW(TAG, "Unable to determine EFR32 variant from probed text sensors (board/mfg/manufacturer)");
  return {};
}

bool EFR32Flasher::wait_for_ncp_start_(uint32_t ms){
  uint32_t t0 = esphome::millis();
  uint8_t prev = 0;
  while (millis() - t0 < ms){
    uint8_t b;
    if (uart_ && uart_->available() && uart_->read_byte(&b)){
      if (prev == '{' && b == '~') return true;
      prev = b;
    } else {
      delay_(2);
    }
  }
  return false;
}

} } // namespace
// PPP FCS-16 (used by ASH). Polynomial 0x8408, init 0xFFFF, output one's complement, LSB first.
// CRC-HQX (poly 0x1021, init 0xFFFF), big-endian append, as used by bellows' ASH
static uint16_t ash_crc_hqx_be_(const uint8_t *data, size_t len) {
  return esphome::efr32::ash::crc_hqx_be(data, len);
}

void esphome::efr32_flasher::write_escaped_(esphome::uart::UARTComponent *uart, const uint8_t *data, size_t len) {
  esphome::efr32::ash::write_escaped(uart, data, len);
}

// Build and send a generic ASH frame (control+data already prepared)
namespace esphome { namespace efr32_flasher {
static void ash_send_frame_(esphome::uart::UARTComponent *uart, const uint8_t *frame, size_t len) {
  if (uart == nullptr)
    return;
  std::vector<uint8_t> tmp(frame, frame + len);
  uint16_t crc = ash_crc_hqx_be_(frame, len);
  tmp.push_back(static_cast<uint8_t>((crc >> 8) & 0xFF));
  tmp.push_back(static_cast<uint8_t>(crc & 0xFF));
  uart->write_byte(esphome::efr32::ash::FLAG);
  esphome::efr32_flasher::write_escaped_(uart, tmp.data(), tmp.size());
  uart->write_byte(esphome::efr32::ash::FLAG);
}

// Pseudo-random data sequence generator (same algorithm as bellows)
static void ash_randomize_(uint8_t *data, size_t len) { esphome::efr32::ash::randomize(data, len); }
// Send a DATA frame with minimal sequencing (frm_num=0, re_tx=0, ack_num=0 by default)
static void ash_send_data_(esphome::uart::UARTComponent *uart, const std::vector<uint8_t> &ezsp_payload, uint8_t frm_num, uint8_t ack_num, bool re_tx) {
  if (uart == nullptr)
    return;
  std::vector<uint8_t> buf;
  uint8_t ctrl = static_cast<uint8_t>(((frm_num & 0x07) << 4) | (re_tx ? 0x08 : 0x00) | (ack_num & 0x07));
  buf.push_back(ctrl);
  std::vector<uint8_t> rnd(ezsp_payload);
  if (!rnd.empty())
    ash_randomize_(rnd.data(), rnd.size());
  buf.insert(buf.end(), rnd.begin(), rnd.end());
  ash_send_frame_(uart, buf.data(), buf.size());
}
// Send an ACK frame (supervisory, not-extended)
static void ash_send_ack_(esphome::uart::UARTComponent *uart, uint8_t ack_num, bool ncp_ready) {
  uint8_t ctrl = static_cast<uint8_t>(0x80 | (ncp_ready ? 0x08 : 0x00) | (ack_num & 0x07));
  ash_send_frame_(uart, &ctrl, 1);
}
} } // namespace
